---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsOBJImportLinkAvailable
source: html/a40a6f4e-185e-1ca8-f13a-510694d9aa3d.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsOBJImportLinkAvailable Method

Checks whether the OBJ Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsOBJImportLinkAvailable()
```

## Returns
True if the OBJ Import/Link functionality is available in the installed Revit.

## Remarks
OBJ Import/Link is optional functionality that does not have to be a part of the Revit installation.